import numpy as np

''' numpy 索引和切片与列表 list 是一样的【从 0 开始索引】 '''
lst2 = [[10, 20, 30],  # 0 索引  [10, 20, 30]   0 索引 10
        [40, 50, 60]]  # 1 索引  [40, 50, 60]   0 索引 40
# lst2[索引值]

''' 1. 索引：ndarray[索引] '''
arr2 = np.array(lst2)  # shape(2, 3)   axis(0, 1)
print(arr2[0])
print(arr2[0].shape)  # shape(3,)
# print(arr2[2])
print(arr2[0][2])

print(arr2[1, 1])  # 50  第二行的第二个值
# 索引时，按轴的个数与维度，索引的个数不能超过维度 2
#        行, 列
#     axis=0,axis=1


''' 2. 切片：ndarray[起始索引 : 停止索引 : 步长, 索引] '''
# 注意：三个点 ... 切片只能使用一次 :
# ndarray[切片, 切片, 切片]    逗号维度减一

print(arr2[:1])
print(arr2[:1].shape)  # shape(1, 3)

arr3 = np.arange(60).reshape(4, 3, 5)
# print(arr3)
print(arr3[0:2])
print(arr3[::2])

print('#' * 50)
print(arr3[:, 0:2, ::2])
#  axis轴： 0全部,  1取0,1,  2取0,2,4

print('#' * 50)
print(arr3[..., ::2])  # axis = 2
print(arr3[:, :, ::2])

print(arr3[..., ::2, :])  # axis = -1 最后一个

# shape(时, 面, 层, 行, 列)
# axis  0,  1, 2,  3,  4
#                 -2  -1

pass
print('#' * 50)
arr4 = np.arange(180).reshape(3, 4, 3, 5)
print(arr4[1, 2].shape)  # (3, 4, 3, 5)  axis=0,1  = (3, 5)

print(arr4[2, 3, 2].shape)  # (3, 4, 3, 5)  axis=0,1,2 = (5,)

print('#' * 50)
print(arr4[0, ..., 4].shape)  # (3, 4, 3, 5)  axis=0,...,3 = (4, 3)

print(arr4[:, 1:3, :2, :].shape)  # (3, 4, 3, 5)     3, 2, 2, 5

print(arr4[:2, ::2].shape)  # (3, 4, 3, 5)      2, 2, 3, 5

''' 3. 花式索引：arr[索引数组,索引数组,索引数组] '''
arr23 = np.array([[10, 20, 30],  [40, 50, 60]])
#                    axis=0 0        0 1

# arr23[axis=0, axis=1]
print(arr23[0])                 # [10 20 30]            1d = (3,)
print(arr23[[0]])               # [[10 20 30]]          2d = (1, 3)
print(arr23[[[0]]])             # [[[10 20 30]]]        3d = (1, 1, 3)

print(arr23[[0, 1, 0, 0]].shape)                      # (2, 3)  2d = (4, 3)

print(arr23[[0], [1]])          # 0轴 0，1轴1    取0轴1索引 = 20   【20】

print(arr23[[0, 1], [1, 0]].shape)    # [20 40]       # (2, 3)  2d = (2, )

print(arr23[[0, 1, 1, 0], [1, 0, 0, 2]])           # 索引数组的个数相同


# 广播机制 [0, 1], 0 --》[0, 1],[0，0]
print(arr23[[0, 1], 0])         # axis=0一维 ，axis=1常数0   [10 40]

print(arr23[[[0, 1], [1, 0]]].shape)  # shape(2, 3) = (索引数组的shape, 3) = (2, 2, 3)

# 广播机制 [0, 1], [1] --> [0, 1], [1, 1]
print(arr23[[0, 1], [1]])         # [0, 1].shape(2, )      [1].shape(1,)

# 广播机制 [[0, 1]], [1] --> [[0, 1]], [[1, 1]]
print(arr23[[[0, 1]], [1]])     # [[20 50]]    shape(2, 3) =  (索引数组的shape)
# [[0, 1]].shape(1, 2)      [1].shape(1,)

arr = np.arange(360).reshape((4, 3, 5, 6))
print(arr)
print(arr[ [0, 1, 2], [ 2, 1, 0], [2, 3, 4], [3, 4, 5] ])       # [ 75 142 209]

print(arr[[[1, 2, 3],[2, 1, 0]], [[1], [2]]])
# [[1, 2, 3],[2, 1, 0]]  shape(2,3),    [[1], [2]]  shape(2,1)  [[1, 1, 1], [2, 2, 2]]
print('#'*50)
print(arr[[[1, 2, 3], [2, 1, 0]], [[1, 2, 1]]])
# [[1, 2, 3],[2, 1, 0]]  shape(2,3),    [[1, 2, 1]]  hape(1,3)  [[1, 2, 1], [1, 2, 1]]


''' 索引数组，连续 arr[..., [1,0], [0,1], :] '''
# shape()
print(arr[ [1, 0], [0, 1] ].shape)           # (4, 3, 5, 6) ==>  (索引shape, 5, 6) ==> (2, 5, 6)
print(arr[ [1, 0], [0, 1],... ].shape)
print(arr[ :, [1, 0], [0, 1],... ].shape)    # (4, 3, 5, 6) ==> (4, 索引shape ,6) ==> (4, 2, 6)


''' 索引数组，不连续 arr[[1,0], .. , [0,1]] '''
print(arr[[1, 0], ..., [0, 1]].shape)
# (4, 3, 5, 6) ==> (索引shape, 3, 5) ==> (2, 3, 5)
# (2, 3, 5, 2)     # (2, 3, 5)     # (3, 5, 2)     # (2, 2, 3, 5)

print(arr[:, [1, 0], :, [0, 1]].shape)   # shape(2,4,5)

print(arr[:, [1], :, [[0, 1,2], [1,2,3]]].shape)       #(2, 3, 4, 5)
print(arr[:, [1, 1, 1], :, [[0, 1,2], [1,2,3]]].shape)
print(arr[:, [[1, 1, 1]], :, [[0, 1,2], [1,2,3]]].shape)
print(arr[:, [[[1, 1, 1]]], :, [[0, 1, 2], [1, 2, 3]]].shape)
# [[[1, 1, 1]]] = size3 = shape(1, 1, 3)

print(arr[:, [[[1]]], :, [[0, 1, 2], [1, 2, 3]]].shape)